alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_i2c.c
/**
  ******************************************************************************
  * @file    rtl8721dhp_usi_i2c.c
  * @author
  * @version V1.0.0
  * @date    2017-12-18
  * @brief   This file contains all the functions prototypes for the I2C firmware
  *          library, including the following functionalities of theIntel-Integrated 
  *             Circuit (I2C) peripheral:
  *           - Initialization
  *           - I2C Speed Setting
  *           - I2C Slave Address Updating
  *           - Receive/Send Data Interface
  *           - I2C Peripheral Control (disable/enable)
  *           - I2C SleepMode Control
  *           - Output pin Configuration
  *           - Interrupts and flags management
  *
  ******************************************************************************
  * @attention
  *
  * This module is a confidential and proprietary property of RealTek and
  * possession or use of this module requires written permission of RealTek.
  *
  * Copyright(c) 2017, Realtek Semiconductor Corporation. All rights reserved.
  ****************************************************************************** 
  */

#include "ameba_soc.h"
#include "rtl8721d_usi_i2c.h"

u32 USI_I2C_SLAVEWRITE_PATCH;
u32 USI_IC_FS_SCL_HCNT_TRIM;
u32 USI_IC_FS_SCL_LCNT_TRIM;

/**
  * @brief  Fills each USI_I2C_StructInit member with its default value.
  * @param  USI_I2C_StructInit: pointer to an USI_I2C_InitTypeDef structure which will be initialized.
  * @retval None
  */
void USI_I2C_StructInit(USI_I2C_InitTypeDef* USI_I2C_InitStruct)
{
	/* Load HAL initial data structure default value */
	USI_I2C_InitStruct->USI_I2CMaster     = USI_I2C_MASTER_MODE;
	USI_I2C_InitStruct->USI_I2CAddrMod    = USI_I2C_ADDR_7BIT;
	USI_I2C_InitStruct->USI_I2CSpdMod     = USI_I2C_SS_MODE;
	USI_I2C_InitStruct->USI_I2CClk        = 100;
	USI_I2C_InitStruct->USI_I2CIPClk      = 50000000;
	USI_I2C_InitStruct->USI_I2CAckAddr    = 0x11;
	USI_I2C_InitStruct->USI_I2CSdaHd      = 1;
	USI_I2C_InitStruct->USI_I2CSlvSetup   = 0x3;
	USI_I2C_InitStruct->USI_I2CRXTL       = 0x01;
	USI_I2C_InitStruct->USI_I2CTXTL       = 0x10;
	USI_I2C_InitStruct->USI_I2CMstReSTR   = DISABLE;
	USI_I2C_InitStruct->USI_I2CMstGC      = DISABLE;
	USI_I2C_InitStruct->USI_I2CMstStartB  = DISABLE;
	USI_I2C_InitStruct->USI_I2CSlvNoAck   = DISABLE;
	USI_I2C_InitStruct->USI_I2CFilter     = 0x11;
	USI_I2C_InitStruct->USI_I2CTxDMARqLv  = 0x09;
	USI_I2C_InitStruct->USI_I2CRxDMARqLv  = 0x04;
}

/**
  * @brief  Initializes the USIx peripheral according to the specified 
  *			parameters in the USI_I2C_InitStruct.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  USI_I2C_InitStruct: pointer to a USI_I2C_InitTypeDef structure that contains
  * 		the configuration information for the specified I2C peripheral.
  * @retval None
  */
void USI_I2C_Init(USI_TypeDef *USIx, USI_I2C_InitTypeDef* USI_I2C_InitStruct)
{
	u8  Specical;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	assert_param(IS_USI_I2C_ADDR_MODE(USI_I2C_InitStruct->USI_I2CAddrMod));
	assert_param(IS_USI_I2C_SPEED_MODE(USI_I2C_InitStruct->USI_I2CSpdMod));
	
	/* Disable the IC first */
	USIx->I2C_ENABLE &= ~USI_I2C_ENABLE;

	/*reset USI all logic, this step will clear tx/rx fifo*/
	USIx->SW_RESET &=(~USI_SW_RESET_RSTB);
	USIx->SW_RESET = 0x1f;

	/*disable USI all mode, configure USI with I2C mode*/
	USIx->USI_MODE_CTRL &= (~USI_SERIAL_MODE);
	USIx->USI_MODE_CTRL |= USI_SERIAL_I2C_MODE;
	
	/* Master case*/
	if (USI_I2C_InitStruct->USI_I2CMaster) {
		/*RESTART MUST be set in these condition in Master mode. 
		But it might be NOT compatible in old slaves.*/
		if ((USI_I2C_InitStruct->USI_I2CAddrMod == USI_I2C_ADDR_10BIT) || (USI_I2C_InitStruct->USI_I2CSpdMod == USI_I2C_HS_MODE) || (USI_I2C_InitStruct->USI_I2CMstStartB != 0))
			USI_I2C_InitStruct->USI_I2CMstReSTR = ENABLE;

		USIx->I2C_CTRL = (USI_I2C_SLV_DISABLE |
			(USI_I2C_InitStruct->USI_I2CSpdMod << 2) |    
			(USI_I2C_InitStruct->USI_I2CMstReSTR << 1) |
			(USI_I2C_InitStruct->USI_I2CMaster));

		/* To set target addr.*/
		Specical = 0;
		if ((USI_I2C_InitStruct->USI_I2CMstGC != 0) || (USI_I2C_InitStruct->USI_I2CMstStartB != 0))
			Specical = 1;

		USIx->I2C_TAR = ((USI_I2C_InitStruct->USI_I2CAddrMod << 12) |
			(Specical << 11)           |
			(USI_I2C_InitStruct->USI_I2CMstStartB << 10)      |
			(USI_I2C_InitStruct->USI_I2CAckAddr & USI_I2C_IC_TAR));

		/* To Set I2C clock*/
		USI_I2C_SetSpeed(USIx, USI_I2C_InitStruct->USI_I2CSpdMod, USI_I2C_InitStruct->USI_I2CClk, USI_I2C_InitStruct->USI_I2CIPClk);
	}    /*if (Master)*/
	else {
		USIx->I2C_CTRL = (((USI_I2C_InitStruct->USI_I2CAckAddr <<12) & USI_I2C_SAR) |
			(USI_I2C_InitStruct->USI_I2CAddrMod << 9) |
			(USI_I2C_InitStruct->USI_I2CMaster << 8) |
			(USI_I2C_InitStruct->USI_I2CSpdMod << 2) |
			(USI_I2C_InitStruct->USI_I2CMaster));

		/* To set slave no ack and ack general call*/
		USIx->I2C_SLV_ACK_CTRL = USI_I2C_InitStruct->USI_I2CSlvNoAck |(USI_I2C_InitStruct->USI_I2CSlvAckGC << 1);
		/* to set SDA setup time */
		USIx->I2C_SDA_TIMING = (USI_I2C_InitStruct->USI_I2CSlvSetup & USI_I2C_SDA_SETUP);
	}
	/* To set SDA hold time */
	USIx->I2C_SDA_TIMING = (((USI_I2C_InitStruct->USI_I2CSdaHd << 16) & USI_I2C_SDA_HOLD) | (USIx->I2C_SDA_TIMING & USI_I2C_SDA_SETUP));
	
	/* To set TX almost empty Level */
	USIx->TX_FIFO_CTRL= USI_I2C_InitStruct->USI_I2CTXTL;

	/* To set RX almost full Level */
	USIx->RX_FIFO_CTRL = USI_I2C_InitStruct->USI_I2CRXTL;

	/* To set IC_FILTER */
	USIx->I2C_DIG_FILTER= USI_I2C_InitStruct->USI_I2CFilter;
	
	/* To set DMA TX/RX level */
	USIx->DMA_REQ_SIZE &= (~(USI_TX_DMA_BURST_SIZE | USI_RX_DMA_BURST_SIZE));
	USIx->DMA_REQ_SIZE |= (USI_I2C_InitStruct->USI_I2CTxDMARqLv | (USI_I2C_InitStruct->USI_I2CRxDMARqLv << 16));

	/*I2C Clear all interrupts first*/
	USI_I2C_ClearAllINT(USIx);

	/*I2C Disable all interrupts first*/
	USI_I2C_INTConfig(USIx, 0xFFFFFFFF, DISABLE);
}

/**
  * @brief  Master sets I2C Speed Mode.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  SpdMd: I2C Speed Mode. 
  *   This parameter can be one of the following values:
  *     @arg USI_I2C_SS_MODE: 
  *     @arg USI_I2C_FS_MODE:  
  *     @arg USI_I2C_HS_MODE:
  * @param  I2Clk: I2C Bus Clock, unit is KHz. 
  *   This parameter can be one of the following values:
  *     @arg 50: 
  *     @arg 100:  
  *     @arg 400:  
  *     @arg 1000: 
  *     @arg 3000: 
  * @param  IPClk: I2C IP Clock, unit is Hz. 
  * @retval None
  */
void USI_I2C_SetSpeed(USI_TypeDef *USIx, u32 SpdMd, u32 I2Clk, u32 I2CIPClk)
{
	u32 ICHLcnt;
	u32 ICHtime;
	u32 ICLtime;
	u32 IPClkM = I2CIPClk /1000000;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	switch (SpdMd)  
	{
		case USI_I2C_SS_MODE:
		{
			ICHtime = ((1000000/I2Clk)*USI_I2C_SS_MIN_SCL_HTIME)/(USI_I2C_SS_MIN_SCL_HTIME+USI_I2C_SS_MIN_SCL_LTIME);
			ICLtime = ((1000000/I2Clk)*USI_I2C_SS_MIN_SCL_LTIME)/(USI_I2C_SS_MIN_SCL_HTIME+USI_I2C_SS_MIN_SCL_LTIME);

