alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_i2c.c
			ICHLcnt = (ICHtime * IPClkM)/1000;			
			USIx->I2C_SS_SCL_CNT = (ICHLcnt & USI_I2C_SS_SCL_HCNT) + 1;
			ICHLcnt = (ICLtime * IPClkM)/1000;
			USIx->I2C_SS_SCL_CNT |= (ICHLcnt << 16) & USI_I2C_SS_SCL_LCNT;

			break;
		}

		case USI_I2C_FS_MODE:
		{
			ICHtime = ((1000000/I2Clk)*USI_I2C_FS_MIN_SCL_HTIME)/(USI_I2C_FS_MIN_SCL_HTIME+USI_I2C_FS_MIN_SCL_LTIME);
			ICLtime = ((1000000/I2Clk)*USI_I2C_FS_MIN_SCL_LTIME)/(USI_I2C_FS_MIN_SCL_HTIME+USI_I2C_FS_MIN_SCL_LTIME);

			ICHLcnt = (ICHtime * IPClkM)/1000;
			if (ICHLcnt > IC_FS_SCL_HCNT_TRIM)/*this part is according to the fine-tune result*/
				ICHLcnt -= IC_FS_SCL_HCNT_TRIM;
			USIx->I2C_FS_SCL_CNT = (ICHLcnt & USI_I2C_FS_SCL_HCNT) + 1;

			ICHLcnt = (ICLtime * IPClkM)/1000;
			if (ICHLcnt > IC_FS_SCL_LCNT_TRIM)/*this part is according to the fine-tune result*/
				ICHLcnt -= IC_FS_SCL_LCNT_TRIM;
			USIx->I2C_FS_SCL_CNT |= (ICHLcnt << 16) & USI_I2C_FS_SCL_LCNT;
			
			break;
		}

		case USI_I2C_HS_MODE:
		{
			/*set Fast mode count for Master code*/
			ICHtime = ((1000000/400)*USI_I2C_FS_MIN_SCL_HTIME)/(USI_I2C_FS_MIN_SCL_HTIME+USI_I2C_FS_MIN_SCL_LTIME);
			ICLtime = ((1000000/400)*USI_I2C_FS_MIN_SCL_LTIME)/(USI_I2C_FS_MIN_SCL_HTIME+USI_I2C_FS_MIN_SCL_LTIME);

			ICHLcnt = (ICHtime * IPClkM)/1000;
			USIx->I2C_FS_SCL_CNT = ICHLcnt & USI_I2C_FS_SCL_HCNT;

			ICHLcnt = (ICLtime * IPClkM)/1000;
			USIx->I2C_FS_SCL_CNT |= (ICHLcnt << 16) & USI_I2C_FS_SCL_LCNT;

			ICHtime = ((1000000/I2Clk)*USI_I2C_HS_MIN_SCL_HTIME_100)/(USI_I2C_HS_MIN_SCL_HTIME_100+USI_I2C_HS_MIN_SCL_LTIME_100);
			ICLtime = ((1000000/I2Clk)*USI_I2C_HS_MIN_SCL_LTIME_100)/(USI_I2C_HS_MIN_SCL_HTIME_100+USI_I2C_HS_MIN_SCL_LTIME_100);

			ICHLcnt = (ICHtime * IPClkM)/1000;
			//if (ICHLcnt>8)/*this part is according to the fine-tune result*/
			//	ICHLcnt -= 3;
			USIx->I2C_HS_SCL_CNT = (ICHLcnt & USI_I2C_HS_SCL_HCNT)+1;

			ICHLcnt = (ICLtime * IPClkM)/1000;
			//if (ICHLcnt>6)/*this part is according to the fine-tune result*/
			//	ICHLcnt -= 6;
			USIx->I2C_HS_SCL_CNT |= (ICHLcnt << 16) & USI_I2C_HS_SCL_LCNT;

			break;
		}    

		default:
		break;
	}
}

/**
  * @brief  Master transmits the address byte to select the slave device.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  Address: specifies the slave address which will be transmitted
  * @retval None.
  */
void USI_I2C_SetSlaveAddress(USI_TypeDef *USIx, u16 Address)
{
	u32 tar = USIx->I2C_TAR & ~(USI_I2C_IC_TAR);
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	/*set target address to generate start signal*/
	USIx->I2C_TAR = (Address & USI_I2C_IC_TAR) | tar;
}

/**
  * @brief  Checks whether the specified I2C flag is set or not.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  USI_I2C_FLAG: specifies the flag to check. 
  *   This parameter can be one of the following values:
  *     @arg USI_I2C_BUS_ACTIVITY: BUS FSM Activity Status. 
  *     @arg USI_I2C_SLV_ACTIVITY: Slave FSM Activity Status.
  *     @arg USI_I2C_MST_ACTIVITY: Master FSM Activity Status.
  *     @arg USI_I2C_ACTIVITY_COMB: I2C Activity Status, combine Master and Slave.
  *     @arg USI_I2C_ENABLE_COPY: i2c_enable copy to here
  * @retval The new state of USI_I2C_FLAG:
  *          - 1: the specified I2C flag is set
  *          - 0: the specified I2C flag is not set 
  */
u8 USI_I2C_CheckFlagState(USI_TypeDef *USIx, u32 USI_I2C_FLAG)
{
	u8 bit_status = 0;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	if((USIx->I2C_STATUS & USI_I2C_FLAG) != 0)
	{
		/* USI_I2C_FLAG is set */
		bit_status = 1;
	}

	/* Return the USI_I2C_FLAG status */
	return  bit_status;
}

/**
  * @brief  Checks whether the specified I2C TXFIFO flag is set or not.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  USI_I2C_TXFIFO_FLAG: specifies the flag to check. 
  *   This parameter can be one of the following values:
  *     @arg USI_TXFIFO_ALMOST_EMPTY_COPY: TX FIFO ALMOST EMPTY status
  *     @arg USI_TXFIFO_EMPTY: TX FIFO EMPTY status
  *     @arg USI_TXFIFO_FULL: TX FIFO FULL status
  * @retval The new state of USI_I2C_TXFIFO_FLAG:
  *          - 1: the specified I2C flag is set
  *          - 0: the specified I2C flag is not set 
  */
u8 USI_I2C_CheckTXFIFOState(USI_TypeDef *USIx, u32 USI_I2C_TXFIFO_FLAG)
{
	u8 bit_status = 0;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	if((USIx->TX_FIFO_STATUS & USI_I2C_TXFIFO_FLAG) != 0)
	{
		/* USI_I2C_TXFIFO_FLAG is set */
		bit_status = 1;
	}

	/* Return the USI_I2C_TXFIFO_FLAG status */
	return  bit_status;
}

/**
  * @brief  Checks whether the specified I2C RXFIFO flag is set or not.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  USI_I2C_RXFIFO_FLAG: specifies the flag to check. 
  *   This parameter can be one of the following values:
  *     @arg USI_RXFIFO_ALMOST_FULL_COPY: RX FIFO ALMOST EMPTY status
  *     @arg USI_RXFIFO_EMPTY: RX FIFO EMPTY status
  *     @arg USI_RXFIFO_FULL: RX FIFO FULL status
  * @retval The new state of USI_I2C_RXFIFO_FLAG:
  *          - 1: the specified I2C flag is set
  *          - 0: the specified I2C flag is not set 
  */
u8 USI_I2C_CheckRXFIFOState(USI_TypeDef *USIx, u32 USI_I2C_RXFIFO_FLAG)
{
	u8 bit_status = 0;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	if((USIx->RX_FIFO_STATUS & USI_I2C_RXFIFO_FLAG) != 0)
	{
		/* USI_I2C_RXFIFO_FLAG is set */
		bit_status = 1;
	}

	/* Return the USI_I2C_RXFIFO_FLAG status */
	return  bit_status;
}
/**
  * @brief  ENABLE/DISABLE  the I2C's interrupt bits..
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  USI_I2C_IT: specifies the USIx interrupt sources to be enabled or disabled.
  *          This parameter can be one or combinations of the following values:
  *            @arg USI_I2C_DMA_DONE_INTER_EN: I2C DMA Done Interrupt
  *            @arg USI_I2C_LP_WAKE_INTER_EN: I2C Low power wakeup Interrupt
  *            @arg USI_I2C_GEN_CALL_INTER_EN: General Call Interrupt
  *            @arg USI_I2C_START_DET_INTER_EN: Start or Restart Condition Interrupt
  *            @arg USI_I2C_STOP_DET_INTER_EN: Stop Condition Interrupt
  *            @arg USI_I2C_ACTIVITY_INTER_EN: I2C Activity Interrupt
  *            @arg USI_I2C_RX_DONE_INTER_EN: Slave Transmitter RX Done Interrupt
  *            @arg USI_I2C_TX_ABRT_INTER_EN: Transmit Abort Interrupt
  *            @arg USI_I2C_RD_REQ_INTER_EN: Read Request Interrupt
  *            @arg USI_RXFIFO_UNDERFLOW_INTR_EN: RX FIFO underflow Interrupt
  *            @arg USI_RXFIFO_OVERFLOW_INTR_EN: RX FIFO overflow Interrupt
  *            @arg USI_RXFIFO_ALMOST_FULL_INTR_EN: RX FIFO almost Full Interrupt
  *            @arg USI_TXFIFO_OVERFLOW_INTR_EN: TX FIFO overflow Interrupt
  *            @arg USI_TXFIFO_ALMOST_EMTY_INTR_EN: TX FIFO almost Empty Interrupt
  * @param  NewState: specifies the state of the interrupt.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void USI_I2C_INTConfig(USI_TypeDef *USIx, u32 USI_I2C_IT, u32 NewState)
{
	u32 TempVal = USIx->INTERRUPT_ENABLE;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	if (NewState == ENABLE) {
		TempVal |= USI_I2C_IT;
	} else {
		TempVal &= ~USI_I2C_IT;
	}

	USIx->INTERRUPT_ENABLE = TempVal;
}

/**
  * @brief  Clears the specified I2C interrupt pending bit.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  INTrBit: specifies the interrupt to be cleared.
  *          This parameter can be one of the following values:
  *            @arg USI_I2C_DMA_DONE_CLR: clear I2C DMA Done interrupt 
  *            @arg USI_I2C_LP_WAKE_CLR: clear I2C Low Power wakeup Interrupt
  *            @arg USI_I2C_GEN_CALL_CLR: clear General Call Interrupt
  *            @arg USI_I2C_START_DET_CLR: clear Start or Restart Condition Interrupt
  *            @arg USI_I2C_STOP_DET_CLR: clear Stop Condition Interrupt
  *            @arg USI_I2C_ACTIVITY_CLR: clear I2C Activity Interrupt
  *            @arg USI_I2C_RX_DONE_CLR: clear Slave Transmitter RX Done Interrupt
  *            @arg USI_I2C_TX_ABRT_CLR: clear Transmit Abort Interrupt
  *            @arg USI_I2C_RD_REQ_CLR: clear Read Request Interrupt
  *            @arg USI_RXFIFO_UNDERFLOW_CLR: clear RX FIFO underflow Interrupt
  *            @arg USI_RXFIFO_OVERFLOW_CLR: clear RX FIFO overflow Interrupt
  *            @arg USI_TXFIFO_OVERFLOW_CLR: clear TX FIFO overflow Interrupt
  * @note   USI_TXFIFO_ALMOST_EMTY_INTS is automatically cleared by hardware when the buffer 
  *         level goes above the TX_FIFO_CTRL threshold.
  *         USI_RXFIFO_ALMOST_FULL_INTS is automatically cleared by hardware when the buffer 
  *         level goes below the RX_FIFO_CTRL threshold. 
  * @retval None
  */
void USI_I2C_ClearINT(USI_TypeDef *USIx, u32 INTrBit)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	/*write 1 to clear all interrupts*/
	USIx->INTERRUPT_STATUS_CLR =  INTrBit;
}

/**
  * @brief  Clears all of the I2C interrupt pending bit.
  * @param  USIx: where USIx can be USI0_DEV.
  * @retval None
  */
void USI_I2C_ClearAllINT(USI_TypeDef *USIx)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));

	/*write 1 to clear all interrupts*/
	USIx->INTERRUPT_ALL_CLR = USI_INT_ALL_CLEAR;
}

/**
  * @brief  Get I2C Raw Interrupt Status.
  * @param  USIx: where USIx can be USI0_DEV.
  * @retval raw interrupt status
  */
u32 USI_I2C_GetRawINT(USI_TypeDef *USIx)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
