alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_i2c.c
	return USIx->RAW_INTERRUPT_STATUS;
}

/**
  * @brief  Get I2C interrupt status.
  * @param  USIx: where USIx can be USI0_DEV.
  * @retval interrupt status
  */
u32 USI_I2C_GetINT(USI_TypeDef *USIx)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	return USIx->INTERRUPT_STATUS;
}

/**
  * @brief  Master sends single byte through the USIx peripheral according to the set of the upper layer.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  pBuf: point to the data that to be write.
  * @param  I2CCmd: specifies whether a read from FIFO or a write to FIFO is performed.
  * @param  I2CStop: specifies whether a STOP is issued after the byte is sent or received.
  * @param  I2CReSTR: specifies whether a RESTART is issued after the byte is sent or received.
  * @retval None
*/
void USI_I2C_MasterSendNullData(USI_TypeDef *USIx, u8* pBuf, u8  I2CCmd, u8  I2CStop, u8  I2CReSTR)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	USIx->TX_FIFO_WRITE = *(pBuf) |
		(1 << 11) |
		(I2CReSTR << 10) |
		(I2CCmd << 8) |
		(I2CStop << 9);    
}

/**
  * @brief  Master sends single byte through the USIx peripheral according to the set of the upper layer.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  pBuf: point to the data that to be write.
  * @param  I2CCmd: specifies whether a read from FIFO or a write to FIFO is performed.
  * @param  I2CStop: specifies whether a STOP is issued after the byte is sent or received.
  * @param  I2CReSTR: specifies whether a RESTART is issued after the byte is sent or received.
  * @retval None
*/
void USI_I2C_MasterSend(USI_TypeDef *USIx, u8* pBuf, u8  I2CCmd, u8  I2CStop, u8  I2CReSTR)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	USIx->TX_FIFO_WRITE = *(pBuf) |
		(I2CReSTR << 10) |
		(I2CCmd << 8) |
		(I2CStop << 9);    
}

/**
  * @brief  Slave sends single byte through the USIx peripheral after receiving read request of Master.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  Data: data to be transmitted.
  * @param  StopState: specifies whether a STOP is issued after the byte is sent.
  * @retval None
  */
void USI_I2C_SlaveSend(USI_TypeDef *USIx, u8 Data)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	USIx->TX_FIFO_WRITE = Data;
}

/**
  * @brief  Returns the most recent received data by the USIx peripheral.
  * @param  USIx: where USIx can be USI0_DEV.
  * @retval The value of the received data.
  */
u8 USI_I2C_ReceiveData(USI_TypeDef *USIx)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	/* Return the data in the DR register */
	return (u8)USIx->RX_FIFO_READ;
}

/**
  * @brief  Send data with special length in master mode through the USIx peripheral.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  pBuf: point to the data to be transmitted.
  * @param	len: the length of data that to be transmitted.
  * @note  deal with condition that master send address or data while slave no ack
  * @retval The length of data that have been sent to tx fifo
  */
u8 USI_I2C_MasterWrite(USI_TypeDef *USIx, u8* pBuf, u8 len)
{
	u8 cnt = 0;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	/* Write in the DR register the data to be sent */
	for(cnt = 0; cnt < len; cnt++)
	{
		while((USI_I2C_CheckTXFIFOState(USIx, USI_TXFIFO_ALMOST_EMPTY_COPY)) == 0);
		
		if(cnt >= len - 1)
		{
			/*generate stop signal*/
			USIx->TX_FIFO_WRITE = (*pBuf++) | (1 << 9);
		}
		else
		{
			USIx->TX_FIFO_WRITE = (*pBuf++);
		}

		while((USI_I2C_CheckTXFIFOState(USIx, USI_TXFIFO_EMPTY)) == 0) {
			if(USI_I2C_GetRawINT(USIx) & USI_I2C_TX_ABRT_RSTS) {
				USI_I2C_ClearAllINT(USIx);
				return cnt;
			}
		}
	}

	return cnt;
}

/**
  * @brief  Read data with special length in master mode through the USIx peripheral under in-house IP.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  pBuf: point to the buffer to hold the received data.
  * @param	len: the length of data that to be received.
  * @retval The length of data that have received from rx fifo
  */
u8 USI_I2C_MasterRead(USI_TypeDef *USIx, u8* pBuf, u8 len)
{
	u8 cnt = 0;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	/* read in the DR register the data to be received */
	for(cnt = 0; cnt < len; cnt++)
	{
		if(cnt >= len - 1)
		{
			/* generate stop singal */
			USIx->TX_FIFO_WRITE = 0x0003 << 8;
		}
		else
		{
			USIx->TX_FIFO_WRITE = 0x0001 << 8;
		}

		/* wait for USI_I2C_FLAG_RFNE flag */			
		while((USI_I2C_CheckRXFIFOState(USIx, USI_RXFIFO_EMPTY)) == 1) {
			if(USI_I2C_GetRawINT(USIx) & USI_I2C_TX_ABRT_RSTS) {
				USI_I2C_ClearAllINT(USIx);
				return cnt;
			}
		}
		*pBuf++ = (u8)USIx->RX_FIFO_READ;
	}

	return cnt;
}

/**
  * @brief  Send data with special length in slave mode through the USIx peripheral.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  pBuf: point to the data to be transmitted.
  * @param	len: the length of data that to be transmitted.
  * @retval None
  */
void USI_I2C_SlaveWrite(USI_TypeDef *USIx, u8* pBuf, u8 len)
{
	u8 cnt = 0;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));

	for(cnt = 0; cnt < len; cnt++) {
		/* Check I2C RD Request flag */
		while((USI_I2C_GetRawINT(USIx) & USI_I2C_RD_REQ_RSTS) == 0);

		if (USI_I2C_SLAVEWRITE_PATCH) {
			USIx->INTERRUPT_STATUS_CLR =  USI_I2C_RD_REQ_CLR;
		}
		/* Check I2C TX FIFO status */
		while((USI_I2C_CheckTXFIFOState(USIx, USI_TXFIFO_ALMOST_EMPTY_COPY)) == 0);

		USIx->TX_FIFO_WRITE = (*pBuf++);
	}
	while((USI_I2C_CheckTXFIFOState(USIx, USI_TXFIFO_EMPTY)) == 0);
}

/**
  * @brief  Read data with special length in slave mode through the USIx peripheral.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  pBuf: point to the buffer to hold the received data.
  * @param	len: the length of data that to be received.
  * @retval None
  */
void USI_I2C_SlaveRead(USI_TypeDef *USIx, u8* pBuf, u8 len)
{
	u8 cnt = 0;
	
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	for(cnt = 0; cnt < len; cnt++) {
		/* Check I2C RX FIFO status */
		while((USI_I2C_CheckRXFIFOState(USIx, USI_RXFIFO_EMPTY)) == 1);

		*pBuf++ = (u8)USIx->RX_FIFO_READ;
	}
}
/**
  * @brief  Sends data and read data in master mode through the USIx peripheral.
  * @param  USIx: where USIx can be USI0_DEV to select the I2C peripheral.
  * @param  pWriteBuf: Byte to be transmitted.
  * @param  Writelen: Byte number to be transmitted (the length should less then buffer depth for A CUT).
  * @param  pReadBuf: Byte to be received.
  * @param  Readlen: Byte number to be received.
  * @retval None
  */
void USI_I2C_MasterRepeatRead(USI_TypeDef* USIx, u8* pWriteBuf, u8 Writelen, u8* pReadBuf, u8 Readlen)
{

	u8 cnt = 0;

	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	/* write in the DR register the data to be sent */
	for(cnt = 0; cnt < Writelen; cnt++)
	{
		while((USI_I2C_CheckTXFIFOState(USIx, USI_TXFIFO_ALMOST_EMPTY_COPY)) == 0);
		
		if(cnt >= Writelen - 1)
		{
			/*generate restart signal*/
			USIx->TX_FIFO_WRITE = (*pWriteBuf++) | (1 << 10);
		}
		else
		{
			USIx->TX_FIFO_WRITE = (*pWriteBuf++);
		}
	}

