alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_i2c.c
	GDMA_InitStruct->GDMA_BlockSize = RxCount;
	GDMA_InitStruct->GDMA_DstAddr = (u32)(pRxBuf);

	assert_param(GDMA_InitStruct->GDMA_BlockSize <= 4096);
	
	/* multi block close */
	GDMA_InitStruct->MuliBlockCunt     = 0;
	GDMA_InitStruct->GDMA_ReloadSrc = 0;
	GDMA_InitStruct->MaxMuliBlock = 1;

	GDMA_Init(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, GDMA_InitStruct);
	GDMA_Cmd(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, ENABLE);
	
	return _TRUE;
}

/**
  * @brief  Clock-gated I2C clock domain for address matching interrupts wake up.
  * @param  USIx: where USIx can be USI0_DEV.
  * @param  NewState: the new state of the Rx Path.
  *              This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void USI_I2C_Sleep_Cmd(USI_TypeDef *USIx, u32 NewStatus)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	if (NewStatus != DISABLE) {
		USI_I2C_INTConfig(USIx, USI_I2C_LP_WAKE_INTER_EN, ENABLE);
		
		USIx->I2C_DIG_FILTER &= ~ USI_I2C_DIG_FLTR_SEL;
		USIx->I2C_CTRL &= ~(USI_I2C_SLV_DISABLE);
		USIx->I2C_ENABLE |= USI_I2C_SLEEP;
	} else {
		USI_I2C_INTConfig(USIx, USI_I2C_LP_WAKE_INTER_EN, DISABLE);
		
		USIx->I2C_DIG_FILTER |=  USI_I2C_DIG_FLTR_SEL; 
		USIx->I2C_ENABLE &= ~USI_I2C_SLEEP;
	}
}

/**
  * @brief  Wake up clock domain of Clock-gated I2C after address matching interrupts.
  * @param  USIx: where USIx can be USI0_DEV.
  * @retval None
  */
void USI_I2C_WakeUp(USI_TypeDef *USIx)
{
	/* Check the parameters */
	assert_param(IS_USI_I2C_ALL_PERIPH(USIx));
	
	USI_I2C_ClearINT(USIx, USI_I2C_LP_WAKE_CLR);

	USI_I2C_Sleep_Cmd(USIx, DISABLE);
}

/******************* (C) COPYRIGHT 2016 Realtek Semiconductor *****END OF FILE****/

